#### Terraform Plan 📝`success`

<details><summary>Show Plan</summary>

```terraform
random_id.this: Refreshing state... [id=QpmL7gGXNng]
module.compute.tls_private_key.ssh: Refreshing state... [id=4a54e2b7c411b955f50fefacadb9f8fe2ebfc157]
module.compute.local_file.private_key: Refreshing state... [id=042659e13d01055eaa4b31cf4bcc64c72efbe46d]
data.aws_caller_identity.current: Reading...
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::890742591881:oidc-provider/token.actions.githubusercontent.com]
data.aws_region.current: Reading...
module.compute.data.aws_ami.amazon_linux: Reading...
module.networking.data.aws_availability_zones.available: Reading...
module.test_bucket.aws_s3_bucket.this: Refreshing state... [id=test-bucket-42998bee01973678]
aws_s3_bucket.terraform_state: Refreshing state... [id=rss-devops-terraform-state]
module.compute.aws_key_pair.main: Refreshing state... [id=rss-key]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0a07e4a59c01012ac]
data.aws_region.current: Read complete after 0s [id=eu-north-1]
data.aws_caller_identity.current: Read complete after 0s [id=890742591881]
aws_iam_role.github_actions: Refreshing state... [id=GithubActionsRole]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonEC2FullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848247900000004]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonS3FullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848031600000002]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonEventBridgeFullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848463100000006]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonVPCFullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848011200000001]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/IAMFullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848402200000005]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonRoute53FullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848204200000003]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonSQSFullAccess"]: Refreshing state... [id=GithubActionsRole-20250612135848535200000007]
module.networking.data.aws_availability_zones.available: Read complete after 1s [id=eu-north-1]
module.compute.data.aws_ami.amazon_linux: Read complete after 1s [id=ami-01e27d968e66a4cf5]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-0068246e65e6f1b53]
module.networking.aws_subnet.public[1]: Refreshing state... [id=subnet-0b948541c8c6a91de]
module.networking.aws_subnet.public[0]: Refreshing state... [id=subnet-06e6e56716c5acbd3]
module.security.aws_security_group.public: Refreshing state... [id=sg-09174a94372c67d3a]
module.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-071c2fcd045612d97]
module.security.aws_security_group.bastion: Refreshing state... [id=sg-077928dc76c9f2ef5]
module.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-01fe1613a718ef459]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-009ff0a89fba2e27e]
module.security.aws_security_group.nat: Refreshing state... [id=sg-0efb8e572d7a958e0]
module.vpc.aws_default_route_table.public: Refreshing state... [id=rtb-025467798e7145729]
aws_s3_bucket_versioning.state: Refreshing state... [id=rss-devops-terraform-state]
aws_s3_bucket_server_side_encryption_configuration.state: Refreshing state... [id=rss-devops-terraform-state]
aws_s3_bucket_object_lock_configuration.state: Refreshing state... [id=rss-devops-terraform-state]
module.test_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=test-bucket-42998bee01973678]
module.security.aws_network_acl.public: Refreshing state... [id=acl-088f41ff0129e2fb7]
module.security.aws_network_acl.private: Refreshing state... [id=acl-05c145d6db10befad]
module.security.aws_security_group.private: Refreshing state... [id=sg-0779b057576dbc4a8]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03fa4a7a1991d7bf4]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f839d0d497ef325f]
module.compute.aws_instance.bastion: Refreshing state... [id=i-0cabb854e7714edf5]
module.compute.aws_instance.nat: Refreshing state... [id=i-0f6db709e10c33bff]
module.tests[0].aws_instance.test_public: Refreshing state... [id=i-0aefa49a4c4465c55]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0dbfd3d423eac8352]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e3efbcea3f32e026]
module.tests[0].aws_instance.test_private_az2: Refreshing state... [id=i-0afc235e25055afdd]
module.tests[0].aws_instance.test_private_az1: Refreshing state... [id=i-0f4919202a64f7e22]
aws_route.private_nat: Refreshing state... [id=r-rtb-009ff0a89fba2e27e1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.compute.local_file.private_key will be created
  + resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "modules/compute/keys/rss-key.pem"
      + id                   = (known after apply)
    }

  # module.tests[0].aws_instance.test_private_az1 will be destroyed
  # (because module.tests[0] is not in configuration)
  - resource "aws_instance" "test_private_az1" {
      - ami                                  = "ami-01e27d968e66a4cf5" -> null
      - arn                                  = "arn:aws:ec2:eu-north-1:890742591881:instance/i-0f4919202a64f7e22" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "eu-north-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0f4919202a64f7e22" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "rss-key" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-0ba05783bc86f5452" -> null
      - private_dns                          = "ip-10-0-3-210.eu-north-1.compute.internal" -> null
      - private_ip                           = "10.0.3.210" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-01fe1613a718ef459" -> null
      - tags                                 = {
          - "Name" = "rss-private-test-server-az1"
        } -> null
      - tags_all                             = {
          - "Name" = "rss-private-test-server-az1"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "1c89b4f8d359743ec5ed818e96f5f47e157d5abc" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-0779b057576dbc4a8",
        ] -> null
        # (9 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-05732d671d0d0726d" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.tests[0].aws_instance.test_private_az2 will be destroyed
  # (because module.tests[0] is not in configuration)
  - resource "aws_instance" "test_private_az2" {
      - ami                                  = "ami-01e27d968e66a4cf5" -> null
      - arn                                  = "arn:aws:ec2:eu-north-1:890742591881:instance/i-0afc235e25055afdd" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "eu-north-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0afc235e25055afdd" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "rss-key" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-037b8b91dc45fde64" -> null
      - private_dns                          = "ip-10-0-4-157.eu-north-1.compute.internal" -> null
      - private_ip                           = "10.0.4.157" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-071c2fcd045612d97" -> null
      - tags                                 = {
          - "Name" = "rss-private-test-server-az2"
        } -> null
      - tags_all                             = {
          - "Name" = "rss-private-test-server-az2"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "85042d969850e9066444dbfbe9be80fbe4eb063e" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-0779b057576dbc4a8",
        ] -> null
        # (9 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0ab8cf1d329099a45" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.tests[0].aws_instance.test_public will be destroyed
  # (because module.tests[0] is not in configuration)
  - resource "aws_instance" "test_public" {
      - ami                                  = "ami-01e27d968e66a4cf5" -> null
      - arn                                  = "arn:aws:ec2:eu-north-1:890742591881:instance/i-0aefa49a4c4465c55" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "eu-north-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0aefa49a4c4465c55" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "rss-key" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-0b1ecbba6e19d719a" -> null
      - private_dns                          = "ip-10-0-1-79.eu-north-1.compute.internal" -> null
      - private_ip                           = "10.0.1.79" -> null
      - public_dns                           = "ec2-13-61-16-184.eu-north-1.compute.amazonaws.com" -> null
      - public_ip                            = "13.61.16.184" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-06e6e56716c5acbd3" -> null
      - tags                                 = {
          - "Name" = "rss-public-test-server"
        } -> null
      - tags_all                             = {
          - "Name" = "rss-public-test-server"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "d117be1a742ef4ac2a25ad2d815d4c3fac6ef45a" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-09174a94372c67d3a",
        ] -> null
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0e7ad67e21b6050d7" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  - test_private_az1_ip     = "10.0.3.210" -> null
  - test_private_az2_ip     = "10.0.4.157" -> null
  - test_public_ip          = "13.61.16.184" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>